Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГражданствоФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
	Элементы.СсылкаНаКартинку.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
	ДокументФизЛица = ПолучитьДокументУдостоверяющийЛичность(); 
	Если ДокументФизЛица <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДокументФизическогоЛица, ДокументФизЛица);
	КонецЕсли;

	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.Наименование.Доступность = Истина;
		Элементы.СотрудникИзменилФИО.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ЗаполнитьГражданствоФизЛица();
	
	ГражданствоФизЛицЛицоБезГражданства = ?(ЗначениеЗаполнено(ГражданствоФизическихЛицСтрана), 0, 1);
	ГражданствоФизЛицЛицоБезГражданстваПриИзменении(Неопределено);
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(СсылкаНаКартинку) Тогда
		
		ФайлКартинки = ПолучитьИзВременногоХранилища(СсылкаНаКартинку);
		
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ФайлКартинки);

		
		УдалитьИзВременногоХранилища(СсылкаНаКартинку);
		
		СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
		
	КонецЕсли; 
	
	Отказ = ПроверитьЗаполнениеРеквизитовФормы(); 
	
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьДокументФизЛица();
	ЗаписатьФИОФизЛицаВРегистр();
	ЗаписатьГражданствоФизЛицаВРегистр();
КонецПроцедуры





#Область РаботаСКартинкой

&НаКлиенте
Процедура СсылкаНаКартинкуНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	Режим = РежимДиалогаВыбораФайла.Открытие;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	
	
	ДиалогОткрытия.ПолноеИмяФайла = Неопределено;	
	ДиалогОткрытия.Фильтр = "Файл Jpg (*.jpg)|*.jpg";
	
	
	ДиалогОткрытия.Заголовок = "Выберите файл для загрузки"; 
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла", ЭтаФорма); 
	ДиалогОткрытия.Показать(ОписаниеОповещения);
	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл, ДополнительныеПараметры) Экспорт 
	Если ВыбранныйФайл = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СсылкаНаКартинку = ВыбранныйФайл[0];
     
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОписаниеОповещенияОЗавершении", ЭтаФорма);
	
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещенияОЗавершении, , , , СсылкаНаКартинку, УникальныйИдентификатор);
	

	
КонецПроцедуры

&НаКлиенте 
Процедура ОписаниеОповещенияОЗавершении(ОписаниеПереданногоФайла, ДополнительныеПраметры) Экспорт 
	Если ПустаяСтрока(СсылкаНаКартинку) Тогда 
		 Возврат;
	 КонецЕсли; 
	 
	 СсылкаНаКартинку = ОписаниеПереданногоФайла.Адрес;
	 Модифицированность = Истина;
 КонецПроцедуры
 


&НаКлиенте
Процедура УдалитьИзображение(Команда)
	ЭтотОбъект.СсылкаНаКартинку = Неопределено;
	УдалениеИзображения();
КонецПроцедуры 

&НаСервере
Процедура УдалениеИзображения()
	
    ОчисткаХранилища = РеквизитФормыВЗначение("Объект");
   	ОчисткаХранилища.Картинка = Новый ХранилищеЗначения(Неопределено);
    ОчисткаХранилища.Записать();
   	ЗначениеВРеквизитФормы(ОчисткаХранилища, "Объект");	
	
КонецПроцедуры

#КонецОбласти   


&НаКлиенте
Процедура ГражданствоФизЛицЛицоБезГражданстваПриИзменении(Элемент)
	Если ГражданствоФизЛицЛицоБезГражданства = 0 Тогда
		Элементы.ГражданствоФизическихЛицСтрана.Доступность = Истина;
	ИначеЕсли ГражданствоФизЛицЛицоБезГражданства = 1 Тогда
		Элементы.ГражданствоФизическихЛицСтрана.Доступность = Ложь;
		ГражданствоФизическихЛицСтрана = Неопределено;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаписатьДокументФизЛица()
	
		СтарыйДокумент = ПолучитьДокументУдостоверяющийЛичность();
		
		Если СтарыйДокумент <> Неопределено Тогда
			НаборЗаписей = РегистрыСведений.ДокументыФизическихЛиц.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизЛицо.Установить(СтарыйДокумент.ФизЛицо);
			НаборЗаписей.Отбор.ВидДокумента.Установить(СтарыйДокумент.ВидДокумента);
			НаборЗаписей.Прочитать();
			
			
			НоваяЗапись = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, НаборЗаписей[0]); 
			НоваяЗапись.Прочитать();
			НоваяЗапись.ДокументУдостоверяющийЛичность = Ложь;
			НоваяЗапись.Записать(Ложь); 
		КонецЕсли;
		
		НовыйДокумент = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи(); 
	
		НовыйДокумент.Период = ДокументФизическогоЛица.Период;
		НовыйДокумент.ФизЛицо = Объект.Ссылка;
		НовыйДокумент.ВидДокумента = ДокументФизическогоЛица.ВидДокумента;
		НовыйДокумент.Серия = ДокументФизическогоЛица.Серия;
		НовыйДокумент.Номер = ДокументФизическогоЛица.Номер;
		НовыйДокумент.КемВыдан = ДокументФизическогоЛица.КемВыдан;
		НовыйДокумент.ДатаВыдачи = ДокументФизическогоЛица.ДатаВыдачи;
		НовыйДокумент.СрокДействия = ДокументФизическогоЛица.СрокДействия;
		НовыйДокумент.ДокументУдостоверяющийЛичность = Истина;
	
		НовыйДокумент.Записать(Истина);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьДокументУдостоверяющийЛичность()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыФизическихЛицСрезПоследних.Период КАК Период,
		|	ДокументыФизическихЛицСрезПоследних.ВидДокумента КАК ВидДокумента,
		|	ДокументыФизическихЛицСрезПоследних.Серия КАК Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер КАК Номер,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
		|	ДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
		|	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
		|	ДокументыФизическихЛицСрезПоследних.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛицСрезПоследних
		|ГДЕ
		|	ДокументыФизическихЛицСрезПоследних.ДокументУдостоверяющийЛичность = &Истина
		|	И ДокументыФизическихЛицСрезПоследних.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("Истина", Истина);  
	Запрос.УстановитьПараметр("ФизЛицо", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи;
	КонецЕсли; 
		
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеРеквизитовФормы()
	
	Если Не ЗначениеЗаполнено(ДокументФизическогоЛица.ВидДокумента) Тогда
		Сообщить("Не заполнено поле ""Вид документа""!!!");
		Возврат Истина; 
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Элементы.Наименование.Доступность = Ложь;
	Элементы.СотрудникИзменилФИО.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникИзменилФИОНажатие(Элемент)
	Элементы.Наименование.Доступность = Истина;
	Элементы.СотрудникИзменилФИО.Видимость = Ложь; 	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьФИОФизЛицаВРегистр() 	
	НоваяЗапись = РегистрыСведений.ФИОФизическихЛиц.СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.ФизическоеЛицо = Объект.Ссылка;
	НоваяЗапись.ФИО = Объект.Наименование;
	НоваяЗапись.Записать(Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГражданствоФизЛицаВРегистр()
	НоваяЗапись = РегистрыСведений.ГражданствоФизическихЛиц.СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Период = ГражданствоФизическихЛицПериод;
	НоваяЗапись.ФизическоеЛицо = Объект.Ссылка;
	НоваяЗапись.Страна = ГражданствоФизическихЛицСтрана; 
	НоваяЗапись.Записать();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьГражданствоФизЛица()
	СведенияОГражданстве = ПолучитьГражданствоФизЛица(Объект.Ссылка);
	
	ГражданствоФизическихЛицПериод = СведенияОГражданстве.Период;
	ГражданствоФизическихЛицСтрана = СведенияОГражданстве.Страна;
КонецПроцедуры

&НаСервере
Функция ПолучитьГражданствоФизЛица(СсылкаНаОбъект)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
	|	ГражданствоФизическихЛицСрезПоследних.Период КАК Период,
	|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна
	|ИЗ
	|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(, ФизическоеЛицо = &ФизическоеЛицо) КАК ГражданствоФизическихЛицСрезПоследних";
	
	Запрос.Параметры.Вставить("ФизическоеЛицо", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса;
	КонецЕсли;
		
	Возврат Неопределено;	
КонецФункции
